require 'rubygems'
require 'ryba'

module RuGenerator
  @@zip = { #1xx
          'Москва' => [*(101..129)], 'Московская обл.' => [*(140..142), 144], 'Ярославская обл.' => [150,152], 'Ивановская обл.' => [153], 'Костромская обл.' => [156], 'Вологодская обл.' => [*(160..162)], 
          'Архангельская обл.' => [163], 'Ненецкий автономный округ' => [166], 'Республика Коми' => [*(167..169)], 'Тверская обл.' => [170], 'Новгородская обл.' => [173], 'Псковская обл.' => [180], 
          'Мурманская обл.' => [183,184], 'Республика Карелия' => [185,186], 'Ленинградская обл.' => [187, 188], 'Санкт Петербург' => [*(190..199)], 
          #2xx
          'Смоленская обл.' => [214], 'Калининградская обл.' => [236], 'Брянская обл.' =>[241], 'Калужская обл.' => [248], 
          #3xx
          'Тульская обл.' => [300,301], 'Орловская обл.' => [302], 'Курская обл.' => [305], 'Белгородская обл.' => [308], 'Ростовская обл.' => [344], 'Краснодарский край' => [350], 'Ставропольский край'=>[355], 
          'Республика Калмыкия'=> [358,359], 'Кабардино-Балкарская Республика' => [360,361], 'Республика Северная Осетия-Алания' => [362,363], 'Чеченская Республика' => [364], 'Республика Дагестан' => [367, 368], 
          'Карачаево-Черкесская Республика' => [369], 'Республика Адыгея' => [385], 'Республика Ингушетия' => [386], 'Рязанская обл.' => [390], 'Тамбовская обл.' => [392], 'Воронежская обл.' => [394,396,397], 
          'Липецкая обл.' => [398],
          #4xx
          'Волгоградская обл.' => [400,403,404], 'Саратовская обл.' => [410], 'Астраханская обл.' => [414], 'Республика Татарстан' => [420], 'Республика Марий Эл' => [424,425], 'Удмуртская Республика' => [426], 
          'Чувашская Республика' => [428], 'Республика Мордовия' => [430,431], 'Ульяновская обл.' => [432], 'Пензенская обл.' => [440], 'Самарская обл.' => [443], 'Республика Башкортостан' => [450,452,453], 
          'Челябинская обл.' => [454], 'Оренбургская обл.' => [460], 
          #6xx
          'Владимирская обл.' => [600, 601, 602], 'Нижегородская обл.' => [603, 606, 607], 'Кировская обл.' => [610], 'Пермский край' => [614], 'Свердловская обл.' => [620], 'Тюменская обл.' => [625], 
          'Ханты-Мансийский автономный округ' => [628], 'Ямало-Ненецкий автономный округ' => [629], 'Новосибирская обл.' => [630], 'Томская обл.' => [634], 'Курганская обл.' => [640], 'Омская обл.' => [644], 
          'Алтайский край' => [649], 'Кемеровская обл.' => [650], 'Республика Хакасия' => [655], 'Республика Алтай' => [656], 'Красноярский край' => [660], 'Иркутская обл.' => [664,665], 'Республика Тыва' => [667], 
          'Республика Бурятия' => [670,671], 'Амурская обл.' => [675], 'Республика Саха' => [677,678], 'Еврейская автономная область' => [679], 'Хабаровский край' => [680], 'Камчатский край' => [683], 
          'Магаданская обл.' => [685], 'Чукотский автономный округ' => [689], 'Приморский край' => [690], 'Сахалинская обл.' => [693], 'Забайкальский край' => [673]}

  def self.create_name
    Ryba::Name.full_name
  end
  def self.create_address
    address_wr_index = Ryba::Address.postal
    words_counter = address_wr_index.split(', ')
    if @@zip[words_counter[1]] != nil
      words_counter[0][0..2] = @@zip[words_counter[1]].first.to_s
    else
      may_key = words_counter[1][3..5]
      @@zip.keys.each do |key_from_hash|
        may_key = key_from_hash if key_from_hash[0..2] == may_key
      end
      words_counter[0][0..2] = @@zip[may_key].first.to_s
    end
    words_counter.join(', ')
  end
  def self.create_telephone
    Ryba::PhoneNumber.phone_number
  end
end
